{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "8fcf6705",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import os\n",
    "from neo4j import GraphDatabase\n",
    "from dotenv import load_dotenv\n",
    "\n",
    "\n",
    "load_dotenv()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "9fd8af76",
   "metadata": {},
   "outputs": [],
   "source": [
    "NEO4J_USERNAME = os.getenv(\"NEO4J_USERNAME\", \"<instance-id>\")\n",
    "NEO4J_PASSWORD = os.getenv(\"NEO4J_PASSWORD\", \"<password>\")\n",
    "NEO4J_URI = os.getenv(\"NEO4J_URI\", f\"neo4j+s://{NEO4J_USERNAME}.databases.neo4j.io\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f5d9637c",
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(NEO4J_URI, auth=(NEO4J_USERNAME, NEO4J_PASSWORD))\n",
    "driver.verify_connectivity()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "65036739",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0\n"
     ]
    }
   ],
   "source": [
    "records, summary, keys = driver.execute_query( # (1)\n",
    "    \"RETURN COUNT {()} AS count\"\n",
    ")\n",
    "\n",
    "# Get the first record\n",
    "first = records[0]      # (2)\n",
    "\n",
    "# Print the count entry\n",
    "print(first[\"count\"])   # (3)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "a7766bdd",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N50', status_description='warn: label does not exist. The label `Movie` does not exist in database `baf63d89`. Verify that the spelling is correct.', position=<SummaryInputPosition line=2, column=49, offset=49>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 49, 'line': 2, 'column': 49}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\nMATCH (p:Person {name: $name})-[r:ACTED_IN]->(m:Movie)\\nRETURN m.title AS title, r.role AS role\\n'\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N52', status_description='warn: property key does not exist. The property `role` does not exist in database `baf63d89`. Verify that the spelling is correct.', position=<SummaryInputPosition line=3, column=28, offset=83>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 83, 'line': 3, 'column': 28}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\nMATCH (p:Person {name: $name})-[r:ACTED_IN]->(m:Movie)\\nRETURN m.title AS title, r.role AS role\\n'\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N50', status_description='warn: label does not exist. The label `Person` does not exist in database `baf63d89`. Verify that the spelling is correct.', position=<SummaryInputPosition line=2, column=10, offset=10>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 10, 'line': 2, 'column': 10}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\nMATCH (p:Person {name: $name})-[r:ACTED_IN]->(m:Movie)\\nRETURN m.title AS title, r.role AS role\\n'\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N52', status_description='warn: property key does not exist. The property `title` does not exist in database `baf63d89`. Verify that the spelling is correct.', position=<SummaryInputPosition line=3, column=10, offset=65>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 65, 'line': 3, 'column': 10}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\nMATCH (p:Person {name: $name})-[r:ACTED_IN]->(m:Movie)\\nRETURN m.title AS title, r.role AS role\\n'\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N51', status_description='warn: relationship type does not exist. The relationship type `ACTED_IN` does not exist in database `baf63d89`. Verify that the spelling is correct.', position=<SummaryInputPosition line=2, column=35, offset=35>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 35, 'line': 2, 'column': 35}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\nMATCH (p:Person {name: $name})-[r:ACTED_IN]->(m:Movie)\\nRETURN m.title AS title, r.role AS role\\n'\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N52', status_description='warn: property key does not exist. The property `name` does not exist in database `baf63d89`. Verify that the spelling is correct.', position=<SummaryInputPosition line=2, column=18, offset=18>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 18, 'line': 2, 'column': 18}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\nMATCH (p:Person {name: $name})-[r:ACTED_IN]->(m:Movie)\\nRETURN m.title AS title, r.role AS role\\n'\n"
     ]
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "MATCH (p:Person {name: $name})-[r:ACTED_IN]->(m:Movie)\n",
    "RETURN m.title AS title, r.role AS role\n",
    "\"\"\"\n",
    "name = \"Tom Hanks\"\n",
    "\n",
    "records, summary, keys = driver.execute_query( # (1)\n",
    "    cypher,    # (2)\n",
    "    name=name  # (3)\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "270f2406",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N51', status_description='warn: relationship type does not exist. The relationship type `ACTED_IN` does not exist in database `baf63d89`. Verify that the spelling is correct.', position=<SummaryInputPosition line=2, column=39, offset=39>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 39, 'line': 2, 'column': 39}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\nMATCH path = (person:Person)-[actedIn:ACTED_IN]->(movie:Movie {title: $title})\\nRETURN path, person, actedIn, movie\\n'\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N50', status_description='warn: label does not exist. The label `Person` does not exist in database `baf63d89`. Verify that the spelling is correct.', position=<SummaryInputPosition line=2, column=22, offset=22>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 22, 'line': 2, 'column': 22}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\nMATCH path = (person:Person)-[actedIn:ACTED_IN]->(movie:Movie {title: $title})\\nRETURN path, person, actedIn, movie\\n'\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N52', status_description='warn: property key does not exist. The property `title` does not exist in database `baf63d89`. Verify that the spelling is correct.', position=<SummaryInputPosition line=2, column=64, offset=64>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 64, 'line': 2, 'column': 64}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\nMATCH path = (person:Person)-[actedIn:ACTED_IN]->(movie:Movie {title: $title})\\nRETURN path, person, actedIn, movie\\n'\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N50', status_description='warn: label does not exist. The label `Movie` does not exist in database `baf63d89`. Verify that the spelling is correct.', position=<SummaryInputPosition line=2, column=57, offset=57>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 57, 'line': 2, 'column': 57}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\nMATCH path = (person:Person)-[actedIn:ACTED_IN]->(movie:Movie {title: $title})\\nRETURN path, person, actedIn, movie\\n'\n"
     ]
    }
   ],
   "source": [
    "movie = \"Toy Story\"\n",
    "\n",
    "records, summary, keys = driver.execute_query(\"\"\"\n",
    "MATCH path = (person:Person)-[actedIn:ACTED_IN]->(movie:Movie {title: $title})\n",
    "RETURN path, person, actedIn, movie\n",
    "\"\"\", title=movie)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "77170039",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "ai (3.13.5)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.14.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
